module.exports.onChat = async ({ api, event, message }) => {
try {
const body = event.body ? event.body.toLowerCase() : "";
if (body.startsWith("baby") || body.startsWith("bby")) {
const arr = body.replace(/^\S+\s*/, "");

const randomReplies = [

"😘",
"Bolo jaan 🥺",
"Assalamu Alaikum 💖",
"Bolo jaan ki korte pari apnar jonno!",
"বেশি bot Bot করলে leave নিবো কিন্তু😒😒",
"শুনবো না😼 তুমি আমাকে প্রেম করাই দাও নাই🥺",
"আমি আবাল দের সাথে কথা বলি না, ok😒",
"এতো ডেকো না, প্রেম এ পরে যাবো তো🙈",
"Bolo Babu, তুমি কি আমাকে ভালোবাসো? 🙈💋",
"বার বার ডাকলে মাথা গরম হয়ে যায় কিন্তু😑",
"হ্যা বলো😒, তোমার জন্য কি করতে পারি😐😑?",
"এতো ডাকছিস কেন? গালি শুনবি নাকি? 🤬",
"I love you janu🥰",
"আরে Bolo আমার জান, কেমন আছো?😚",
"Bot বলে অসম্মান করছি,😰😿",
"Hop beda😾, Boss বল boss😼",
"চুপ থাক, নাই তো তোর দাত ভেগে দিবো কিন্তু",
"Bot না, জানু বল জানু 😘",
"বার বার Disturb করছিস, আমার জানুর সাথে ব্যাস্ত আছি😋",
"বোকাচোদা এতো ডাকিস কেন🤬",
"আমাকে ডাকলে, আমি কিন্তু কিস করে দিবো😘",
"আমারে এতো ডাকিস না আমি মজা করার mood এ নাই এখন😒",
"হ্যাঁ জানু, এইদিক এ আসো কিস দেই🤭 😘",
"দূরে যা, তোর কোনো কাজ নাই, শুধু bot bot করিস 😉😋🤣",
"তোর কথা তোর বাড়ি কেউ শুনে না, তো আমি কোনো শুনবো? 🤔😂",
"আমাকে ডেকো না, আমি ব্যাস্ত আছি",
"কি হলো, মিস্টেক করচ্ছিস নাকি🤣",
"বলো কি বলবা, সবার সামনে বলবা নাকি?🤭🤏",
"কালকে দেখা করিস তো একটু 😈",
"হা বলো, শুনছি আমি 😏",
"আর কত বার ডাকবি, শুনছি তো",
"হুম বলো কি বলবে😒",
"বলো কি করতে পারি তোমার জন্য",
"আমি তো অন্ধ কিছু দেখি না🐸 😎",
"Bot না জানু, বল 😌",
"বলো জানু 🌚",
"তোর কি চোখে পড়ে না আমি ব্যাস্ত আছি😒",
"হুম জান তোমার ওই খানে উম্মহ😑😘",
"আহ শুনা আমার তোমার অলিতে গলিতে উম্মাহ😇😘",
"jang hanga korba😒😬",
"হুম জান তোমার অইখানে উম্মমাহ😷😘",
"আসসালামু আলাইকুম বলেন আপনার জন্য কি করতে পারি..!🥰",
"আমাকে এতো না ডেকে বস Apon এর কে একটা গফ দে 🙄",
"আমাকে এতো না ডেকছ কেন ভলো টালো বাসো নাকি🤭🙈",
"🌻🌺💚 আসসালামু আলাইকুম ওয়া রাহমাতুল্লাহ 💚🌺🌻",
"আমি এখন বস Apon এর সাথে বিজি আছি আমাকে ডাকবেন না 😕😏 ধন্যবাদ 🤝🌻",
"আমাকে না ডেকে আমার বস Apon কে একটা জি এফ দাও 😽🫶🌺",
"ঝাং থুমালে আইলাপিউ পেপি 💝😽",
"উফফ বুঝলাম না এতো ডাকছেন কেনো 😤😡😈",
"জান তোমার নানি'রে আমার হাতে তুলে দিবা 🙊🙆‍♂",
"আজকে আমার মন ভালো নেই তাই আমারে ডাকবেন না 😪🤧",
"ঝাং 🫵থুমালে য়ামি রাইতে পালুপাসি উম্মম্মাহ 🌺🤤💦",
"চুনা ও চুনা আমার বস Apon এর হবু বউ রে কেও দেকছো খুজে পাচ্ছি না 😪🤧😭",
"স্বপ্ন তোমারে নিয়ে দেখতে চাই তুমি যদি আমার হয়ে থেকে যাও 💝🌺🌻",
"জান হাঙ্গা করবা 🙊😝🌻",
"জান মেয়ে হলে চিপায় আসো ইউটিউব থেকে অনেক ভালোবাসা শিখছি তোমার জন্য 🙊🙈😽",
"ইসস এতো ডাকো কেনো লজ্জা লাগে তো 🙈🖤🌼",
"আমার বস Apon এর পক্ষ থেকে তোমারে এতো এতো ভালোবাসা 🥰😽🫶 আমার বস Apon এর জন্য দোয়া করবেন 💝💚🌺🌻",
"ভালোবাসা নামক আব্লামি করতে মন চাইলে আমার বস Apon এর ইনবক্স চলে যাও 🙊🥱👅 🌻 Facebook ID Link 🌻: https://www.facebook.com/share/1Akgu2iVCB/",
"জান তুমি শুধু আমার, আমি তোমারে ৩৬৫ দিন ভালোবাসি 💝🌺😽",
"জান বাল ফালাইবা 🙂🥱🙆‍♂",
"আন্টি 🙆 আপনার মেয়ে 👰‍♀️ রাতে আমারে ভিদু কল দিতে বলে 🫣🥵🤤💦",
"oii 🥺🥹 এক🥄 চামচ ভালোবাসা দিবা 🤏🏻🙂",
"আপনার সুন্দরী বান্ধুবীকে ফিতরা হিসেবে আমার বস Apon কে দান করেন 🥱🐰🍒",
"ও মিম ও মিম 😇 তুমি কেন চুরি করলা সাদিয়ার ফর্সা হওয়ার ক্রীম 🌚🤧",
"অনুমতি দিলাম propose কর বস Apon কে 🐸😾🔪",
"গায়ের যৌবনের কসম দিয়ে আমারে blackmail করা হচ্ছে 🥲🤦‍♂️🤧",
"Oi আন্টি 🙆‍♂️ তোমার মেয়ে চোখ মারে 🥺🥴🐸",
"তাকাই আছো কেন চুমু দিবা 🙄🐸😘",
"আজকে প্রপোজ করে দেখো রাজি হইয়া যামু 😌🤗😇",
"আমার গল্পে তোমার নানি সেরা 🙊🙆‍♂️🤗",
"কি ব্যাপার আপনি শ্বশুর বাড়িতে যাচ্ছেন না কেন 🤔🥱🌻",
"দিনশেষে পরের BOW সুন্দর ☹️🤧",
"তাবিজ কইরা হইলেও ফ্রেম এক্কান করমুই তাতে যা হই হোক 🤧🥱🌻",
"ছোটবেলা ভাবতাম বিয়ে করলে অটোমেটিক বাচ্চা হয় 🥱 ওমা এখন দেখি কাহিনী অন্যরকম 😦🙂🌻",
"আজ একটা বিন নেই বলে ফেসবুকের নাগিন 🤧 গুলোরে আমার বস Apon ধরতে পারছে না 🐸🥲",
"চুমু থাকতে তোরা বিড়ি খাস কেন বুঝা আমারে 😑😒🐸⚒️",
"যে ছেড়ে গেছে 😔 তাকে ভুলে যাও 🙂 আমার বস Apon এর সাথে প্রেম করে তাকে দেখিয়ে দাও 🙈🐸🤗",
"হাজারো লুচ্চা লুচ্চির ভিরে 🙊🥵 আমার বস Apon এক নিস্পাপ ভালো মানুষ 🥱🤗🙆‍♂️",
"রূপের অহংকার করো না 🙂❤️ চকচকে সূর্যটাও দিনশেষে অন্ধকারে পরিণত হয় 🤗💜",
"সুন্দর মাইয়া মানেই 🥱 আমার বস Apon এর বউ 😽🫶 আর বাকি গুলো আমার বেয়াইন 🙈🐸🤗",
"এত অহংকার করে লাভ নেই 🌸 মৃত্যুটা নিশ্চিত শুধু সময়টা অ'নিশ্চিত 🖤🙂",
"দিন দিন কিছু মানুষের কাছে অপ্রিয় হয়ে যাইতেছি 🙂😿🌸",
"হুদাই আমারে শয়তানে লারে 😝😑☹️",
"I LOVE YOU 😽 আহারে ভাবছো তোমারে প্রোপজ করছি 🥴 থাপ্পর দিয়া কিডনী লক করে দিব 😒 ভুল পড়া বের করে দিবো 🤭🐸",
"আমি একটা দুধের শিশু 😇 🫵YOU🐸💦",
"কতদিন হয়ে গেলো বিছনায় মুতি না 😿 মিস ইউ নেংটা কাল 🥺🤧",
"বালিকা 👸 do you 🫵 বিয়া me 😽 আমি তোমাকে 😻 আম্মু হইতে সাহায্য করব 🙈🥱",
"এই আন্টির মেয়ে 🫢🙈 ummmmah 😽🫶 আসলেই তো স্বাদ 🥵💦 এতো স্বাদ কেন 🤔 সেই স্বাদ 😋",
"ইস কেউ যদি বলতো 🙂 আমার শুধু তোমাকেই লাগবে 💜🌸",
"ওই বেডি তোমার বাসায় না আমার বস Apon মেয়ে দেখতে গেছিলো 🙃 নাস্তা আনারস আর দুধ দিছো 🙄🤦‍♂️",
"একদিন সে ঠিকই ফিরে তাকাবে 😇 আর মুচকি হেসে বলবে ওর মতো আর কেউ ভালবাসেনি 🙂😅",
"হুদাই গ্রুপে আছি 🥺🐸 কেও ইনবক্সে নক দিয়ে বলে না জান তোমারে আমি অনেক ভালোবাসি 🥺🤧",
"কি'রে গ্রুপে দেখি একটাও বেডি নাই 🤦‍🥱💦",
"দেশের সব কিছুই চুরি হচ্ছে 🙄 শুধু আমার বস Apon এর মনটা ছাড়া 🥴😑😏",
"🫵তোমারে প্রচুর ভাল্লাগে 😽 সময় মতো প্রপোজ করমু বুঝছো 🔨😼 ছিট খালি রাইখো 🥱🐸🥵",
"আজ থেকে আর কাউকে পাত্তা দিমু না 😏 কারণ আমি ফর্সা হওয়ার ক্রিম কিনছি 🙂🐸",
"প্রিয় 🥺 তোমাকে না পেলে আমি সত্যি 😪 আরেকজন কে 😼 পটাতে বাধ্য হবো 😑🤧",
"কিরে🫵 তরা নাকি prem করস 😐🐸 আমারে একটা করাই দিলে কি হয় 🥺",
"যেই আইডির মায়ায় পড়ে ভুল্লি আমারে 🥴 তুই কি যানিস সেই আইডিটাও আমি চালাইরে 🙂"
];

if (!arr) {    
    await api.sendMessage(    
      randomReplies[Math.floor(Math.random() * randomReplies.length)],    
      event.threadID,    
      (error, info) => {    
        global.GoatBot.onReply.set(info.messageID, {    
          commandName: this.config.name,    
          type: "reply",    
          messageID: info.messageID,    
          author: event.senderID    
        });    
      },    
      event.messageID    
    );    
  }    

  const a = (await axios.get(`${await baseApiUrl()}/baby?text=${encodeURIComponent(arr)}&senderID=${event.senderID}&font=1`)).data.reply;    
  await api.sendMessage(a, event.threadID, (error, info) => {    
    global.GoatBot.onReply.set(info.messageID, {    
      commandName: this.config.name,    
      type: "reply",    
      messageID: info.messageID,    
      author: event.senderID,    
      a    
    });    
  }, event.messageID);    
}

} catch (err) {
return api.sendMessage(Error: ${err.message}, event.threadID, event.messageID);
}
};

      
